Revit 2024 API
FormatOptions.SuppressSpaces Property
 Indicates if spaces around the dash should be suppressed in feet and fractional inches.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool SuppressSpaces { get; set; }
Visual Basic
Public Property SuppressSpaces As Boolean
	Get
	Set
Visual C++
public:
property bool SuppressSpaces {
	bool get ();
	void set (bool value);
}
Field Value
 True if spaces should be suppressed, false otherwise. The default is false.
Remarks
This property is applicable to display units related to feet and fractional inches:
DUT_FEET_FRACTIONAL_INCHES
DUT_RISE_OVER_FOOT
DUT_RISE_OVER_10_FEET
When SuppressLeadingZeros is true, spaces will not be inserted before and after the dash separating feet from inches. For example, 1' - 2 3/4" will be displayed as 1'-2 3/4".
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  UseDefault is true in this FormatOptions. -or- When setting this property: SuppressSpaces was set to true but spaces cannot be suppressed for the display unit in this FormatOptions.
See Also
FormatOptions Class
Autodesk.Revit.DB Namespace